In [84]:
import numpy as np
import pandas as pd

# Building Series

In [85]:
#Series are built on top of numpy arrays
#To create a series you need data (list) and labels (indicies)
#Series are 1 dimensional, dataframes are 2 dimensional
our_list = ['s', 'e', 'r', 'i', 'e', 's']
our_labels = [1,2,3,4,5,6]

#Creating the series:
series = pd.Series(data=our_list, index = our_labels)
series

1    s
2    e
3    r
4    i
5    e
6    s
dtype: object

In [86]:
#Making another series that automatically indexes your entries
array1 = np.array(['a', 'b', 'c', 'd', 'e', 'f', 
                  'g', 'h', 'i', 'j', 'k', 'l', 
                  'm', 'n', 'o', 'p', 'q', 'r', 
                  's', 't', 'u', 'v', 'w', 'x', 
                  'y', 'z', ])
series2 = pd.Series(array1)
series2

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [87]:
#You can make series out of dictionaries:

dictionary = {"planet":"Earth", "species":"human", "matter":"organic",}
series3 = pd.Series(dictionary)
series3


series3["planet"] #You can get data by using the label as your index
series3.dtype #Gets the data type for that series

##Can perform operations on series
data2 = np.array([1,2,3,4,5])
series5 = pd.Series(data2)

print("Addition:", series5 + series5)
print("Subtraction: ", series5 - series5)
print("Multiplication: ", series5 * series5)
print("Division: ", series5 / series5)

#Main difference between series and numpy array is series align by label. 
#You can also name a series 

data3 = data2*5
series6 = pd.Series(data3, name = 'Name of series 6')
series6.name

Addition: 0     2
1     4
2     6
3     8
4    10
dtype: int32
Subtraction:  0    0
1    0
2    0
3    0
4    0
dtype: int32
Multiplication:  0     1
1     4
2     9
3    16
4    25
dtype: int32
Division:  0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

'Name of series 6'

# Building Dataframes
These are made up of multiple series that share the same index or label, and may contain multiple different data types.

In [88]:
#If you use the print function to call a dataframe, it will not look as nice as when you just call the dataframe as the
#last statement in the cell. It will instead look like raw text in need of formatting. 
#Making another data frame
a = np.random.randint(10,50, size=(2,3))
dataframe1 = pd.DataFrame(a, ['A', 'B'], ['C', 'D','E']) #AB are the row labels, CDE are the column labels. 
dataframe1

    C   D   E
A  44  33  27
B  30  13  23

In [89]:
#Can make a dataframe with multiple series

d ={'one':pd.Series([1.,2.,3.,4.], index = ['a','b','c','d']),
    'two':pd.Series([2,4,6,8], index = ['a','b','c','d'])}
dataframe2 = pd.DataFrame(d)
dataframe2

#from_dict will accept column labels and lists
pd.DataFrame.from_dict(dict([('a', [1,2,3]), ('b', [4,5,6])]))
#orient (to the index) allows you to assign the keys as row labels and column labels seperately
pd.DataFrame.from_dict(dict([('a', [1,2,3]), ('b', [4,5,6])]),
                      orient = 'index', columns = [ 'one', 'two', 'three'])
                            
#finding out number of rows and columns in a dataframe
print(dataframe2.shape)

(4, 2)

# Editing and Retrieving Entries in a Dataframe

In [90]:
dataframe1

    C   D   E
A  44  33  27
B  30  13  23

In [91]:
dataframe1['C'] #Retrieving a column by calling its key

A    44
B    30
Name: C, dtype: int32

In [92]:
dataframe1[['C', 'D']] #Retrieving multiple columns by calling their keys in a list

    C   D
A  44  33
B  30  13

In [93]:
dataframe1.loc['A'] #Retrieving a row by calling its label

C    44
D    33
E    27
Name: A, dtype: int32

In [94]:
dataframe1.iloc[0] #Retrieving the first row by calling its index position, 0

C    44
D    33
E    27
Name: A, dtype: int32

In [95]:
dataframe1.loc['A', 'C'] #Grab a cell with a row and a column

44

In [96]:
dataframe1.loc[['A', 'B'], ['D', 'E']]#Get multiple cells by defining the rows and columns wanted

    D   E
A  33  27
B  13  23

In [97]:
#Can build new columns, let's say you want the total of the columns 
dataframe1['Total'] = dataframe1['C']+dataframe1['E']
dataframe1 #contains new column we just built

    C   D   E  Total
A  44  33  27     71
B  30  13  23     53

In [98]:
#Again but with multiplication
dataframe2['Mult'] = dataframe2['one'] * dataframe2['two']
dataframe2

   one  two  Mult
a  1.0    2   2.0
b  2.0    4   8.0
c  3.0    6  18.0
d  4.0    8  32.0

In [99]:
#Doing the same but with a row 
dict2 = {'C':44, 'D':45, 'E':46}
new_row = pd.Series(dict2, name='F')
dataframe1 = dataframe1.append(new_row)
dataframe1 #This only has a nan because our previously defined Total column wasn't set up to work with this new row

      C     D     E  Total
A  44.0  33.0  27.0   71.0
B  30.0  13.0  23.0   53.0
F  44.0  45.0  46.0    NaN

In [100]:
#Can delete columns 
dataframe1.drop('Total',axis=1, inplace = True)
dataframe1 #Can only run this cell once obviously because once you delete Total you can't delete it again

      C     D     E
A  44.0  33.0  27.0
B  30.0  13.0  23.0
F  44.0  45.0  46.0

In [101]:
dataframe1.drop('B', axis=0, inplace = True)
dataframe1

      C     D     E
A  44.0  33.0  27.0
F  44.0  45.0  46.0

In [102]:
#Create a new column and make it the index
dataframe1['Sex'] = ['Men', 'Women']
dataframe1.set_index('Sex', inplace = True)
dataframe1

          C     D     E
Sex
Men    44.0  33.0  27.0
Women  44.0  45.0  46.0

In [103]:
#How to reset index values back to numbers
#dataframe1.reset_index(inplace=True)
#dataframe1

In [104]:
dataframe2.assign(division=dataframe2['one'] / dataframe2['two'])

   one  two  Mult  division
a  1.0    2   2.0       0.5
b  2.0    4   8.0       0.5
c  3.0    6  18.0       0.5
d  4.0    8  32.0       0.5

In [105]:
#You can use ".assign()" to pass in a function so we'll do an anonymous function lambda here
dataframe2.assign(division=lambda x: (x['one'] / x['two']))
dataframe2

   one  two  Mult
a  1.0    2   2.0
b  2.0    4   8.0
c  3.0    6  18.0
d  4.0    8  32.0

In [106]:
#Can combine dataframes
dataframe3 = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
dataframe4 = pd.DataFrame({'A': [8., 9., 2., 4. ]})
dataframe3.combine_first(dataframe4)

     A
0  1.0
1  9.0
2  3.0
3  4.0

# Conditional Selection of Data

In [107]:
#Starting with a new dataframe
arr_2 = np.random.randint(10, 50, size = (2,3))
dataframe1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
print (dataframe1)

    C   D   E
A  28  13  37
B  42  15  34

<!-- Tables -->
| Comparison Op. | Shorthand|
| -------- | --------------  |
|  Greater than | gt|                     
| Less than | lt |  
| Greater than or equal | ge|   
| Less than or equal | le|
|   Equal | eq|  
|Not Equal| ne|

In [108]:
print('Greater than 40 \n', dataframe1 > 40)
print('Greater than 40 \n', dataframe1.gt(40.))      
#Works with lt, ge, le, eq, ne (less than, greater or equal, less or equal, equal, not equal)

In [109]:
#Can place conditions in brackets
bool_1 = dataframe1 >=45.0
dataframe1[bool_1]

    C   D   E
A NaN NaN NaN
B NaN NaN NaN

In [110]:
#can also get booleans for a column
dataframe1['E'] > 40

A    False
B    False
Name: E, dtype: bool

In [111]:
#Suppose we want to know if the cell value for a column matches a condition
#stack up the dataframes and ask for the column and your condition:
dataframe1[dataframe1['E'] > 30]

    C   D   E
A  28  13  37
B  42  15  34

In [112]:
#Can focus on a column based on a resulting dataframe:
dataframe2 = dataframe1[dataframe1['E'] > 30]
dataframe2['C']

A    28
B    42
Name: C, dtype: int32

In [113]:
#Can stack the commands
print(dataframe1[dataframe1['E'] > 20]['C'])

A    28
B    42
Name: C, dtype: int32

In [114]:
#Can grab multiple different columns
print(dataframe1[dataframe1['E'] > 20][['C', 'D']])

    C   D
A  28  13
B  42  15

In [115]:
#Can select for multiple different conditions
arr_3 = np.array([[1,2,3], [4,5,6], [7,8,9]])
df_2= pd.DataFrame(arr_3, ['A', 'B', 'C'], ['X', 'Y', 'Z'])
print(df_2)
df_2[(df_2['X'] > 3) & (df_2['X'] < 7)] #Using and
# df_2[(df_2['X'] > 3) | (df_2['X'] < 7)] #Using or, which returns all values

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

   X  Y  Z
B  4  5  6

# File I/O

In [116]:
cs_df = pd.read_csv('ComputerSales.csv')
cs_df

#If you make changes and want to save it to a csv file 
cs_df.to_csv('ComputerSales_backup.csv')

#Can also read data from an excel file
pd.read_excel('Financial Sample.xlsx', 0)

#Can also write to an excel file
cs_df.to_excel('ComputerSales_backup.xlsx')
#Can check if its been written
pd.read_excel('ComputerSales_backup.xlsx') #and indeed it was written

,Unnamed: 0,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year
0,0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018
1,1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018
2,2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018
3,3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018
4,4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018
...,...,...,...,...,...,...,...,...,...,...,...,...,...
97,97,98,Michelle Samms,F,46,NY,17-BY3613DX,Laptop,609.99,140.34,Flyer 3,November,2019
98,98,99,Mick Roberts,M,23,PA,BB980,Desktop,889.99,110.89,Flyer 2,May,2019
99,99,100,Ed Klondike,M,52,OH,15M-ED0023DX,Laptop,989.99,111.34,Email,November,2019
100,100,101,Moe Eggert,M,35,PA,GMA4000BST,Desktop,589.99,138.64,Website,May,2019
101,101,102,Jessica Elk,F,55,PA,AN515-55-53AG,Tablet,669.99,136.69,Flyer 1,December,2019

# Basics and Math

In [117]:
cs_df.head() #first 5 results
cs_df.tail() #last 5 results
cs_df[:2] #first two results, just use a slice
cs_df[:5:2] #first five results in steps of two
cs_df.index.array #gets indices
cs_df.to_numpy() #converts it all into a numpy array, which is very large
series2.array #covnerting a series to an array

<PandasArray>
['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
Length: 26, dtype: object

In [118]:
#Creating another dataframe to work with
dict_3 = {'one':pd.Series([1,2,3], index=['a', 'b', 'c']),
         'two':pd.Series([1,2,3,4], index=['a', 'b', 'c','d'])}
df_2 = pd.DataFrame(dict_3)
print(df_2)
#Can replace any nan values using fillna function
print(df_2.fillna(0, inplace = True)) #if there are any nan values they'll be replaced with zeros

#Get the values in row 2
row  = df_2.iloc[1]
#Can add items in row 2 to all the other rows including row 2
df_2.add(row, axis='columns')

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
None

   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  2.0  6.0

In [119]:
#get column two and subtract that from all other columns
col = df_2['two']
df_2.sub(col, axis = 0)

   one  two
a  0.0    0
b  0.0    0
c  0.0    0
d -4.0    0

In [120]:
#Creating a new dataframe to work with and use transform
df_5 = pd.DataFrame({'A':range(3), 'B': range(1,4)})
df_5

   A  B
0  0  1
1  1  2
2  2  3

In [121]:
#Add 1 to every value in df_5
#df_5.transform(lambda x: x+1) #Adds 1 to every value 
#df_5.transform(lambda x: x**2) #squares every value 
#df_5.transform(lambda x: np.sqrt(x)) #Takes the square root of every value

#Can also transform using multiple different functions
df_5.transform([lambda x: x**2, lambda x: x**3])

         A        B
  <lambda> <lambda>
0        0        1
1        1        8
2        8       27

In [122]:
#Passing a dictionary is going to allow you to different calculations on different columns::
df_5.transform({'A': lambda x: x**2, 'B': lambda x: x**3})

   A   B
0  0   1
1  1   8
2  4  27

In [123]:
#Map allows you to perform a similar function on a series 
df_5['A'].map(lambda x: x**2)

0    0
1    1
2    4
Name: A, dtype: int64

In [124]:
#applymap is going to be able to do the same thing for a dataframe
df_5.applymap(lambda x: x**2)

   A  B
0  0  1
1  1  4
2  4  9

In [125]:
#Can get unique values, lets try column 2
df_2['two'].unique()
df_2['two'].nunique() #Gives total number of unique values
df_2['two'].value_counts()#Can also find out the number of times a value occurs in a column
df_2.columns #can also ask for column names
df_2.index #Gives index information
df_2.isnull #return a dataframe that returns any null values as True

<bound method DataFrame.isnull of    one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  0.0    4>

# Group Data

In [126]:
dict_5 = {'Planet': [1,2,3,4,5,6,7,8,9], 'Number of Moons': [0,0,1,2,79,82,27,14,5]}

df_11 = pd.DataFrame(dict_5)
#Grouping data by the number of moons per planet
by_store = df_11.groupby('Number of Moons')
by_store.mean()
by_store.sum().loc[1]#moon total for planet by index
by_store.describe() #gets a whole bunch of data as seen below

                Planet
                 count mean       std  min   25%  50%   75%  max
Number of Moons
0                  2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0
1                  1.0  3.0       NaN  3.0  3.00  3.0  3.00  3.0
2                  1.0  4.0       NaN  4.0  4.00  4.0  4.00  4.0
5                  1.0  9.0       NaN  9.0  9.00  9.0  9.00  9.0
14                 1.0  8.0       NaN  8.0  8.00  8.0  8.00  8.0
27                 1.0  7.0       NaN  7.0  7.00  7.0  7.00  7.0
79                 1.0  5.0       NaN  5.0  5.00  5.0  5.00  5.0
82                 1.0  6.0       NaN  6.0  6.00  6.0  6.00  6.0

# Concatenate, Merge, and Join Data

In [127]:
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                     index = [1,2,3])
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12]},
                     index = [4,5,6])
df_12

   A  B
1  1  4
2  2  5
3  3  6

In [128]:
df_13

   A   B
4  7  10
5  8  11
6  9  12

In [129]:
#Concatenating these together
pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [130]:
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6],
                     'key' : [1,2,3]})
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12],
                     'key' : [1,2,3]})
#merging two dataframes when their key column is the same

pd.merge(df_12, df_13, how = 'right', on = 'key') #inner merges at the intersection of the join
#if how = left or right, then you're saying you want the keys from the left or right frame
#outer merges by the union of the keys

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [131]:
#How to join two data frames with different indices, instead of keys you use columns
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                     index = [1,2,3])
df_13 = pd.DataFrame({'C': [7,8,9],
                     'D': [10,11,12]},
                     index =  [1,4,5])
df_12.join(df_13, how = 'outer') #You'll get nan values wherever they do not line up

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  8.0  11.0
5  NaN  NaN  9.0  12.0

# Statistics

In [132]:
#This is just a spreadsheet about the planets in our solar system, including PLuto, regarind the
#length of their day in hours and the length of their year in Earth-days
planets_df = pd.read_csv('dayvsyear.csv')
planets_df

   Day (hours)  Year (days)
0       4222.6         88.0
1       2802.0        224.7
2         24.0        365.2
3         24.7        687.0
4          9.9       4331.0
5         10.7      10747.0
6         17.2      30589.0
7         16.1      59800.0
8        153.3      90560.0

In [133]:
planets_df.count()# Get count of both columns
planets_df.sum(skipna=True)#skips nan values if there are any

planets_df["Year (days)"].mean()
planets_df["Year (days)"].median()
planets_df["Year (days)"].mode()
planets_df["Year (days)"].min()
planets_df["Year (days)"].max()
planets_df["Year (days)"].prod() #Product of values
planets_df["Year (days)"].std() #Standard deviation
planets_df["Year (days)"].var() #Variance 
planets_df["Year (days)"].sem() #Standard error
print("Mean days in a year: ", planets_df["Year (days)"].mean())
print("Median days in a year: ", planets_df["Year (days)"].median())
print("Mode days in a year: ", planets_df["Year (days)"].mode())
print("Min days in a year: " , planets_df["Year (days)"].min())
print("Max days in a year: ", planets_df["Year (days)"].max())
print("Product of all values in Year (days): ", planets_df["Year (days)"].prod())
print("Standard Deviation: ", planets_df["Year (days)"].std()) 
print("Variance: ", planets_df["Year (days)"].var())
print("Standard Error: ", planets_df["Year (days)"].sem()) 
planets_df["Year (days)"].skew() #If negative, there exists a long tail towards the left; if positive then right.

planets_df["Year (days)"].kurt() #Tells you how many outliers you have in your data
# less than three: low, exactly 3: normal, greater than 3: high

planets_df["Year (days)"].quantile(.25) #Need to specify which quantile you want, this is the 25% quantile
planets_df["Year (days)"].cumsum() #Cumulative sum of your data
planets_df["Year (days)"].cumprod() #Cumulative product, overloads so I don't reccomend printing it
planets_df["Year (days)"].cummax() #Cumulative max
planets_df["Year (days)"].cummin() #Cumulative min

Mean days in a year:  21932.433333333334
Median days in a year:  4331.0
Mode days in a year:  0       88.0
1      224.7
2      365.2
3      687.0
4     4331.0
5    10747.0
6    30589.0
7    59800.0
8    90560.0
dtype: float64
Min days in a year:  88.0
Max days in a year:  90560.0
Product of all values in Year (days):  3.825177216887456e+31
Standard Deviation:  32631.416950999846
Variance:  1064809372.23
Standard Error:  10877.138983666615

0    88.0
1    88.0
2    88.0
3    88.0
4    88.0
5    88.0
6    88.0
7    88.0
8    88.0
Name: Year (days), dtype: float64

In [134]:
#Nicer way of doing getting important values is using the aggregate function 
planets_df.agg(['mean', 'std', 'var', 'min', 'max', 'sem'])

       Day (hours)   Year (days)
mean  8.089444e+02  2.193243e+04
std   1.573908e+03  3.263142e+04
var   2.477186e+06  1.064809e+09
min   9.900000e+00  8.800000e+01
max   4.222600e+03  9.056000e+04
sem   5.246360e+02  1.087714e+04

# Iteration

In [135]:
#How to iterate over series and dataframes

ser_7 = pd.Series(range(5), index = (['a', 'b', 'c', 'd', 'e']))
arr_4 = np.random.randint(10, 50, size = (2,3))
df_8 = pd.DataFrame(arr_4, ['B', 'C'], ['C', 'D', 'E'])
ser_7

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [136]:
arr_4

array([[28, 46, 27],
       [14, 19, 29]])

In [137]:
df_8

    C   D   E
B  28  46  27
C  14  19  29

In [138]:
for col in ser_7: 
    print(col) #prints the columns which in this case is 1-5

0
1
2
3
4

In [139]:
#Can also iterate over dataframes
for label, ser in df_8.items():
    print(label)
    print(ser) #gets the series assigned to label

C
B    28
C    14
Name: C, dtype: int32
D
B    46
C    19
Name: D, dtype: int32
E
B    27
C    29
Name: E, dtype: int32

In [140]:
#Can also iterate through rows
for index, row in df_8.iterrows():
    print(f"{index}\n{row}")

B
C    28
D    46
E    27
Name: B, dtype: int32
C
C    14
D    19
E    29
Name: C, dtype: int32

In [141]:
#Get a tuple containing your row data
for row in df_8.itertuples():
    print(row)

Pandas(Index='B', C=28, D=46, E=27)
Pandas(Index='C', C=14, D=19, E=29)

Sorting

In [142]:
df_8

    C   D   E
B  28  46  27
C  14  19  29

In [143]:
df_8.sort_index(ascending=False)

    C   D   E
C  14  19  29
B  28  46  27

In [144]:
df_8.sort_values(by='D') #Sort for column D

    C   D   E
C  14  19  29
B  28  46  27

Passing data to functions

In [145]:
#Can pass dataframes as well as series to functions
import sys

In [146]:
def get_profit_total(df): 
    prof_ser = df['Profit']
    print(f"Total Profit : {prof_ser.sum()}")
get_profit_total(cs_df)

Total Profit : 16019.179999999997

In [147]:
#Lets receive a dataframe that will split contact information into two name columns, one labeled
#first name and the other labeled last name

def split_name(df):
    def get_names(full_name):
        f_name, l_name = full_name.split()
#Creating a series with first and last names in columns with those labels
        return pd.Series(
        (f_name, l_name),
        index = ['First: Name', 'Last Name'])
    names = df['Contact'].apply(get_names) #apply executes the function on all the names in our contact column
    df[names.columns] = names
    return df
split_name(cs_df).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First: Name,Last Name
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk

In [148]:
##Assinging people to different age groups based on their age

def create_age_groups(df):
    bins = [0,30, 50, sys.maxsize]
    labels = ['< 30' , '30-50', '> 50 ']
    age_group = pd.cut(df['Age'], bins=bins, labels=labels)#cut is going to put values into certain groups based on intervals
    df['Age Group'] = age_group
    return df
create_age_groups(cs_df)

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First: Name,Last Name,Age Group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,< 30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,> 50
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
97,98,Michelle Samms,F,46,NY,17-BY3613DX,Laptop,609.99,140.34,Flyer 3,November,2019,Michelle,Samms,30-50
98,99,Mick Roberts,M,23,PA,BB980,Desktop,889.99,110.89,Flyer 2,May,2019,Mick,Roberts,< 30
99,100,Ed Klondike,M,52,OH,15M-ED0023DX,Laptop,989.99,111.34,Email,November,2019,Ed,Klondike,> 50
100,101,Moe Eggert,M,35,PA,GMA4000BST,Desktop,589.99,138.64,Website,May,2019,Moe,Eggert,30-50
101,102,Jessica Elk,F,55,PA,AN515-55-53AG,Tablet,669.99,136.69,Flyer 1,December,2019,Jessica,Elk,> 50

In [149]:
#using pipe to pass a dateframe to multiple different functions

cs_df.pipe(split_name).pipe(create_age_groups).head()

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First: Name,Last Name,Age Group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,< 30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,> 50

# Aligning, Reindexing, and Renaming Labels

In [150]:
ser_6 = pd.Series(range(5), index = ['a', 'b', 'c', 'd', 'e'])
sl_1  = ser_6[:4] #beginning item to the fourth item
sl_2 = ser_6[1:] #first item to last item
print(sl_1)
print(sl_2)
#Can align both series by the union of their indices
sl_1.align(sl_2)
#Align by calling series
sl_1.align(sl_2, join = 'left')
sl_1.align(sl_2, join = 'right')
#Can get where the indices intersect by using join = inner
sl_1.align(sl_2, join = 'inner')

a    0
b    1
c    2
d    3
dtype: int64
b    1
c    2
d    3
e    4
dtype: int64

(b    1
 c    2
 d    3
 dtype: int64,
 b    1
 c    2
 d    3
 dtype: int64)

In [151]:
arr_3 = np.random.randint(10,50, size = (2,3))
df_6 = pd.DataFrame(arr_3, ['A', 'B'], ['C', 'D', 'E'])
arr_3 = np.random.randint(10,50, size = (2,3))
df_7 = pd.DataFrame(arr_3, ['B', 'C'], ['C', 'D', 'E'])
#Can align our dataframes
df_6.align(df_7)
#nan values wherever they don't match up; left, right and inner still work depending on what you want.

(      C     D     E
 A  49.0  18.0  45.0
 B  42.0  20.0  22.0
 C   NaN   NaN   NaN,
       C     D     E
 A   NaN   NaN   NaN
 B  35.0  37.0  33.0
 C  38.0  47.0  44.0)

In [152]:
#Reindex allows you to realign by the index
ser_6.reindex(['c', 'b', 'a']) #cba is a choice of ordering indices
#df_6.reindex(['B', 'A']) #Does the same thing

'''I only comment these out because I don't want to play around too much with dropping and clearing '''
#drop is going to receive labels you do not want to include
#df_6.drop(['A'], axis = 0 ) #Dropping a row
#df_6.drop(['D'], axis = 1) #Dropping a column

"I only comment these out because I don't want to play around too much with dropping and clearing "

In [153]:
df_6.rename(columns = {'C' : "Men", 'D' : "Women", 'E' : "Pets"})

   Men  Women  Pets
A   49     18    45
B   42     20    22

Multi-indexing - allows you to store data on multiple different dimensions

In [154]:
#tracking calorie intake among different people in a study
days = ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2']
meals = [1,2,3,1,2,3]
hier_index = list(zip(days, meals)) #zip pairs our days with our meals array
print(hier_index)

[('Day 1', 1), ('Day 1', 2), ('Day 1', 3), ('Day 2', 1), ('Day 2', 2), ('Day 2', 3)]

In [155]:
#Convert list of tuples into each row and column
hier_index = pd.MultiIndex.from_tuples(hier_index)
#Generate a random array that will be the data that will go in our datastructure
arr_5 = np.random.randint(500, 700, size = (6,2))
df_9 = pd.DataFrame(arr_5, hier_index, ['M', 'F'])
df_9

           M    F
Day 1 1  519  515
      2  602  521
      3  634  528
Day 2 1  549  589
      2  617  519
      3  656  679

In [156]:
#Pivot tables
#Lets get the day 1 stuff
df_9.loc['Day 1']
#df_9.loc['Day 1'].loc[1] #Same thing but as a series

     M    F
1  519  515
2  602  521
3  634  528

In [157]:
#Something really specific: Show calories for the female on day two for the second meal
df_9.loc['Day 2'].loc[2]['F']

519

In [158]:
#Can also assign names to Day and Meals column

In [159]:
df_9.index.names = ['Day', 'Meal']
df_9

              M    F
Day   Meal
Day 1 1     519  515
      2     602  521
      3     634  528
Day 2 1     549  589
      2     617  519
      3     656  679

In [160]:
#Can get a cross-section
df_9.xs('Day 2')

        M    F
Meal
1     549  589
2     617  519
3     656  679

In [161]:
#Get the calories for first meal on both days
df_9.xs(1, level = 'Meal')

         M    F
Day
Day 1  519  515
Day 2  549  589

In [162]:
#Lets create another multi-index out of a dataframe using a pivot table

dict_6 = {'A': ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'], #index
          'B': [1,2,3,1,2,3], #index
          'C': ['M', 'F','M', 'F','M', 'F'], #columns
          'D': [1,2,3,4,5,6]} #values 
df_14 = pd.DataFrame(dict_6)
df_14

       A  B  C  D
0  Day 1  1  M  1
1  Day 1  2  F  2
2  Day 1  3  M  3
3  Day 2  1  F  4
4  Day 2  2  M  5
5  Day 2  3  F  6

In [163]:
df_14.pivot_table(values='D', index = ['A', 'B'], columns = ['C'] ) 
#Get some issues with nan values wherever they do not overlap

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN

# Handling Missing Data

In [164]:
dict_4 = {'A': [1,2, np.nan], 'B': [4, np.nan, np.nan], 'C': [7,8,9]}
df_10 = pd.DataFrame(dict_4)
df_10 #The nans are the missing data that we are going to handle

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [165]:
df_10.dropna() #drops rows containing nans, only rows with no nans survive.
#df_10.dropna(axis = 1) #drops columns containing nans, only columns with no nans survive.

     A    B  C
0  1.0  4.0  7

In [166]:
df_10.dropna(thresh=2) #same thing but only drops a row unless it has at least 2 non-nans

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [167]:
df_10.fillna(value = 123) #replaces nans with whatever value you want

       A      B  C
0    1.0    4.0  7
1    2.0  123.0  8
2  123.0  123.0  9

In [168]:
df_10.fillna(value = df_10['A'].mean()) #replaces nans with the mean

     A    B  C
0  1.0  4.0  7
1  2.0  1.5  8
2  1.5  1.5  9

In [169]:
df_10.fillna(method = 'ffill') #Fills with whatever the previos value was using forward-fill
#df_10.fillna(method = 'bfill') #Fills with whatever the previos value was using backward-fill

#If the value is adjacent to a nan then you're still going to have your nan values

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  2.0  4.0  9

Experimenting with Data

In [170]:
cs_df

,Sale ID,Contact,Sex,Age,State,Product ID,Product Type,Sale Price,Profit,Lead,Month,Year,First: Name,Last Name,Age Group
0,1,Paul Thomas,M,43,OH,M01-F0024,Desktop,479.99,143.39,Website,January,2018,Paul,Thomas,30-50
1,2,Margo Simms,F,37,WV,GT13-0024,Desktop,1249.99,230.89,Flyer 4,January,2018,Margo,Simms,30-50
2,3,Sam Stine,M,26,PA,I3670,Desktop,649.99,118.64,Website,February,2018,Sam,Stine,< 30
3,4,Moe Eggert,M,35,PA,I3593,Laptop,399.99,72.09,Website,March,2018,Moe,Eggert,30-50
4,5,Jessica Elk,F,55,PA,15M-ED,Laptop,699.99,98.09,Flyer 4,March,2018,Jessica,Elk,> 50
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
97,98,Michelle Samms,F,46,NY,17-BY3613DX,Laptop,609.99,140.34,Flyer 3,November,2019,Michelle,Samms,30-50
98,99,Mick Roberts,M,23,PA,BB980,Desktop,889.99,110.89,Flyer 2,May,2019,Mick,Roberts,< 30
99,100,Ed Klondike,M,52,OH,15M-ED0023DX,Laptop,989.99,111.34,Email,November,2019,Ed,Klondike,> 50
100,101,Moe Eggert,M,35,PA,GMA4000BST,Desktop,589.99,138.64,Website,May,2019,Moe,Eggert,30-50
101,102,Jessica Elk,F,55,PA,AN515-55-53AG,Tablet,669.99,136.69,Flyer 1,December,2019,Jessica,Elk,> 50

In [171]:
print(cs_df.columns)

Index(['Sale ID', 'Contact', 'Sex', 'Age', 'State', 'Product ID',
       'Product Type', 'Sale Price', 'Profit', 'Lead', 'Month', 'Year',
       'First: Name', 'Last Name', 'Age Group'],
      dtype='object')

In [176]:
#Lets get the sales profit mean
cs_df['Profit'].mean()
#Lets get the product with the highest profit
cs_df[['Product ID', 'Profit']].max(axis = 0).head()

Product ID    X512DA-BTS2020RL
Profit                 1043.39
dtype: object

In [177]:
#Find out the number of people who made purchases from west
cs_df[cs_df['State'] == 'WV']['State'].count()

11

In [178]:
#Let's get the number of purchases in 2019
len(cs_df[cs_df['Year'] == 2019].index)

42

In [179]:
#Let's get the number of sales for each Product ID
cs_df['Product ID'].value_counts()

MY2J2LL             9
GA401IV             6
M01-F0024           5
UX581GV-XB94T       5
81TC00              5
4NM47AA             5
I3593               5
15M-ED              4
GT13-0024           4
AN515-55-53AG       4
GMA4000BST          4
BB980               4
17-BY3613DX         4
15M-ED0023DX        4
GU502LU-BI7N4       3
Q407IQ-BR5N4        3
I3670               3
Q526FA              3
20-C434             2
14-fq0013dx         2
90HV0003US          2
24-DF0014           2
81W0009DUS          2
NP730QCJ-K02US      2
LAH-00001           1
X512DA-BTS2020RL    1
27-XA0014           1
GU502LW-BI7N6       1
GA401IV-BR9N6       1
C433TA-BM3T8        1
MHK03LL/A           1
Q526FA-BI7T13       1
CX22NA-BCLN4        1
FA506IV-BR7N12      1
Name: Product ID, dtype: int64

In [180]:
#Let's get a list of customers that bought a specific product
cs_df[cs_df['Product ID']=='M01-F0024']['Contact']

0     Paul Thomas
9      Phil Jones
20     Jason Case
29     Phil Jones
36     Jason Case
Name: Contact, dtype: object

In [184]:
#how many made a website purchase for a profit of over $200 
cs_df[(cs_df['Lead']=='Website') & (cs_df['Profit'] > 150)]['Lead'].count()

7

In [185]:
#How many product's profit amounts end with 89 cents
cs_df['Profit'].apply(lambda cents: str(cents).split('.')[1]=='89').value_counts()

False    90
True     12
Name: Profit, dtype: int64